Revit 2024 API
RebarShapeDefinitionBySegments.AddBendDefaultRadius Method
 Specify a default-radius bend.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void AddBendDefaultRadius(
	int vertexIndex,
	RebarShapeVertexTurn turn,
	RebarShapeBendAngle angle
)
Visual Basic
Public Sub AddBendDefaultRadius ( _
	vertexIndex As Integer, _
	turn As RebarShapeVertexTurn, _
	angle As RebarShapeBendAngle _
)
Visual C++
public:
void AddBendDefaultRadius(
	int vertexIndex,
	RebarShapeVertexTurn turn,
	RebarShapeBendAngle angle
)
Parameters
vertexIndex
Type: System.Int32
 Index of the vertex (1 to NumberOfVertices - 2).
turn
Type: Autodesk.Revit.DB.Structure.RebarShapeVertexTurn
 Specify turn direction (RebarShapeVertexTurn::Left or RebarShapeVertexTurn::Right).
angle
Type: Autodesk.Revit.DB.Structure.RebarShapeBendAngle
 Specify whether the bend is acute, obtuse, etc.
Remarks
 You must add a bend at each vertex except the first and last.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  vertexIndex is not between 0 and NumberOfVertices.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace